#include <stdio.h>

/*已有3个学生的3门课成绩，分别用函数实现以下功能：

1）计算每个学生的总成绩

2）按照学生总成绩从高到低进行排序*/


float sum( float x[3])

{
   float c[3][3]={{99.5,88.5,89.5},{77.9,56.5,87.5},{92.5,99.0,60.5}};
    x[0]=c[0][0]+c[0][1]+c[0][2];
    x[1]=c[1][0]+c[1][1]+c[1][2];
    x[2]=c[2][0]+c[2][1]+c[2][2];
}
float px(float x[3])
{
    int m=0,n=0,j=0;

    if(x[0]>x[1] &&  x[1]>x[2])
    {   m=0;
        n=1;
        j=2;
    }
    else if(x[0]>x[2]&&x[2]>x[1])
       {
        m=0;
        n=2;
        j=1;
       }

    else if(x[1]>x[0]&&x[0]>x[2])
      {
        m=1;
        n=0;
        j=2;
       }
     else if(x[1]>x[2]&&x[2]>x[0])
      {
        m=1;
        n=2;
        j=0;
       }
         else if(x[2]>x[0]&&x[0]>x[1])
      {
        m=2;
        n=0;
        j=1;
       }
         else if(x[2]>x[1]&&x[1]>x[0])
      {
        m=2;
        n=1;
        j=0;
       }

}

/*
1）在main函数中分别调用以上函数，按照学生三门课程总成绩从大到小输出学生的相关信息。

2）函数自行定义。三个学生的信息在程序中直接赋值。三个学生的信息如下：

1001,11,zhang,99.5,88.5,89.5

1002,22,li,77.9,56.5,87.5

1003,11,wang,92.5,99.0,60.5*/

/*程序运行结果如下：

1001,11,zhang,99.5,88.5,89.5,277.5

1003,11,wang,92.5,99.0,60.5,252.0

1002,22,li,77.9,56.5,87.5,221.9*/



int main()
{
    int a[3][2];

    a[0][0]=1001;a[0][1]=11;
    a[1][0]=1002;a[1][1]=22;
    a[2][0]=1003;a[2][1]=11;

    char b[3][10]={"zhang","wang","li"};

    float c[3][3];

    c[0][0]=99.5;c[0][1]=88.5;c[0][2]=89.5;
    c[1][0]=77.9;c[1][1]=56.5;c[1][2]=87.5;
    c[2][0]=92.5;c[2][1]=99.0;c[2][2]=60.5;

    float x[3];
    int m,n,j;

    sum(x);
    px(x);

    printf("%d%d%c%f%f%f%f\n",a[m][0],a[m][1],b[m],c[m][0],c[m][1],c[m][2],x[m]);
    printf("%d%d%c%f%f%f%f\n",a[n][0],a[n][1],b[n],c[n][0],c[n][1],c[n][2],x[n]);
    printf("%d%d%c%f%f%f%f\n",a[j][0],a[j][1],b[j],c[j][0],c[j][1],c[j][2],x[j]);


    return 0;


}


